/*  EQEMu:  Everquest Server Emulator
    Copyright (C) 2001-2005  EQEMu Development Team (http://eqemulator.net)

    This program is free software; you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation; version 2 of the License.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY except by those people which sell it, which
	are required to give you total support for your newly bought product;
	without even the implied warranty of MERCHANTABILITY or FITNESS FOR
	A PARTICULAR PURPOSE.  See the GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program; if not, write to the Free Software
    Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
*/
#ifndef SPDAT_H
#define SPDAT_H

#include "../common/classes.h"
#include "../common/skills.h"

#define SPELL_UNKNOWN 0xFFFF
#define SPELLBOOK_UNKNOWN 0xFFFFFFFF		//player profile spells are 32 bit

//some spell IDs which will prolly change, but are needed
#define SPELL_LEECH_TOUCH 2766
#define SPELL_LAY_ON_HANDS 87
#define SPELL_HARM_TOUCH 88
#define SPELL_HARM_TOUCH2 2821
#define SPELL_IMP_HARM_TOUCH 2774
#define SPELL_NPC_HARM_TOUCH 929


//#define SPDAT_SIZE		1824000
/* 
   solar: look at your spells_en.txt and find the id of the last spell.

#define SE_ShadowStepDirectional		379 // *not implemented - Shadowstep in a certain direction
#define SE_Knockdown					380 // *not implemented - small knock back + stun or feign?
//#define SE_Unknown381					381	// not used
#define SE_BlockDS						382 // *not implemented - something to do with blocking a % of certain ds?
#define SE_SympatheticProc				383 // implemented - focus on items that has chance to proc a spell when you cast
#define SE_Leap							384	// *not implemented - Leap effect, ie stomping leap
#define SE_LimitSpellGroup				385	// implemented - Limits to spell group(ie type 3 reuse reduction augs that are class specific and thus all share s SG)
#define SE_CastOnCure					387 // *not implemented - Casts a spell when you are cured
#define SE_Forceful_Rejuv				389 // *not implemented - Refresh spell icons
#define SE_HealingFocus					392 // *not implemented - Adds or removes healing from spells
#define SE_HealRate2					393 // not implemented - Appears to be exactly the same as HealRate except with focus restrictions
#define SE_AdditionalHeal				396 // not implemented - Adds/removes healing from specific spells(restricted to spell groups)
#define SE_SwarmPetDuration				398 // *not implemented - Affects the duration of swarm pets
#define SE_Twincast						399 // implemented - cast 2 spells for every 1
#define SE_HealFromMana					400 // *not implemented - Drains mana and heals for each point of mana drained
#define SE_ManaDrainWithDmg				401 // *not implemented - Deals damage based on the amount of mana drained
#define SE_EndDrainWithDmg				402 // *not implemented - Deals damage for the amount of endurance drained
#define SE_Twinproc						405 // implemented - Proc twice
#define SE_SetMaxHP						408 // *not implemented - Sets your max hp to a percent of your original
#define SE_SetMaxMana					409 // *not implemented - Sets your max mana to a percent of your original
#define SE_SetMaxEnd					410 // *not implemented - Sets your max end to a percent of your original
#define SE_LimitClass					411 // *not implemented - Limits to spells of a certain class
#define SE_IncreaseSpellPower			413 // *not implemented - Increases the power of spells(bard only?)
#define SE_LimitSpellSkill				414 // *not implemented - Limits to a skill of spells(ie wind, evocation)
#define SE_AddMeleeProc					419 // *not implemented - Adds a proc
#define SE_GravityEffect				424 // implemented - Pulls/pushes you toward/away the mob at a set pace
#define SE_LimitToSkill					428 // *not implemented - Only fires when a particular skills is used(ie dodge)	
// LAST


#define DF_Permanent		50

// solar: note this struct is historical, we don't actually need it to be
// aligned to anything, but for maintaining it it is kept in the order that
// the fields in the text file are.  the numbering is not offset, but field
// number.  note that the id field is counted as 0, this way the numbers
// here match the numbers given to sep in the loading function net.cpp
//
struct SPDat_Spell_Struct
{
/* 000 */	int			id;	// not used
/* 001 */	char		name[64]; // Name of the spell
/* 002 */	char		player_1[32]; // "PLAYER_1"
/* 003 */	char		teleport_zone[64];	// Teleport zone, pet name summoned, or item summoned
/* 004 */	char		you_cast[64]; // Message when you cast
/* 005 */	char		other_casts[64]; // Message when other casts
/* 006 */	char		cast_on_you[64]; // Message when spell is cast on you 
/* 007 */	char		cast_on_other[64]; // Message when spell is cast on someone else
/* 008 */	char		spell_fades[64]; // Spell fades
/* 009 */	float		range;
/* 010 */	float		aoerange;
/* 011 */	float		pushback;
/* 012 */	float		pushup;
/* 013 */	int32		cast_time; // Cast time
/* 014 */	int32		recovery_time; // Recovery time
/* 015 */	int32		recast_time; // Recast same spell time
/* 016 */	int32		buffdurationformula;
/* 017 */	int32		buffduration;
/* 018 */	int32		AEDuration;	// sentinel, rain of something
/* 019 */	int16		mana; // Mana Used
/* 020 */	sint32		base[EFFECT_COUNT];	//various purposes
/* 032 */	int			base2[EFFECT_COUNT]; //various purposes
/* 044 */	sint16		max[EFFECT_COUNT];
/* 056 */	int16		icon; // Spell icon
/* 057 */	int16		memicon; // Icon on membarthing
/* 058 */	sint32		components[4]; // reagents
/* 062 */	int			component_counts[4]; // amount of regents used
/* 066 */	signed		NoexpendReagent[4];	// focus items (Need but not used; Flame Lick has a Fire Beetle Eye focus.)
											// If it is a number between 1-4 it means components[number] is a focus and not to expend it
											// If it is a valid itemid it means this item is a focus as well
/* 070 */	int16		formula[EFFECT_COUNT]; // Spell's value formula
/* 082 */	int			LightType; // probaly another effecttype flag
/* 083 */	int			goodEffect; //0=detrimental, 1=Beneficial, 2=Beneficial, Group Only
/* 084 */	int			Activated; // probaly another effecttype flag	
/* 085 */	int			resisttype;
/* 086 */	int			effectid[EFFECT_COUNT];	// Spell's effects
/* 098 */	SpellTargetType	targettype;	// Spell's Target
/* 099 */	int			basediff; // base difficulty fizzle adjustment
/* 100 */	SkillType	skill;
/* 101 */	sint16		zonetype;	// 01=Outdoors, 02=dungeons, ff=Any 
/* 102 */	int16		EnvironmentType;
/* 103 */	int			TimeOfDay;
/* 104 */	int8		classes[PLAYER_CLASS_COUNT]; // Classes, and their min levels
/* 120 */	int8		CastingAnim;
/* 121 */	int8		TargetAnim;
/* 122 */	int32		TravelType;
/* 123 */	int16		SpellAffectIndex;
/* 124 */   int         disallow_sit;	// 124: high-end Yaulp spells (V, VI, VII, VIII [Rk 1, 2, & 3], & Gallenite's Bark of Fury
/* 125 */   int         spacing125;   // 125: Words of the Skeptic
/* 126 */	sint8		deities[16];	// Deity check. 201 - 216 per http://www.eqemulator.net/wiki/wikka.php?wakka=DeityList
										// -1: Restrict to Deity; 1: Restrict to Deity, but only used on non-Live (Test Server "Blessing of ...") spells; 0: Don't restrict
/* 142 */ int spacing142[2];	// 142: between 0 & 100
								// 143: always set to 0
/* 144 */	sint16		new_icon;	// Spell icon used by the client in uifiles/default/spells??.tga, both for spell gems & buff window. Looks to depreciate icon & memicon
/* 145 */	sint16		spellanim;	// Doesn't look like it's the same as #doanim, so not sure what this is
/* 146 */	sint8		uninterruptable;	// Looks like anything != 0 is uninterruptable. Values are mostly -1, 0, & 1 (Fetid Breath = 90?)
/* 147 */	sint16		ResistDiff; 
/* 148 */   int			dot_stacking_exempt;
/* 149 */   int			deletable;
/* 150 */	int16		RecourseLink;
/* 151 */ int spacing151[3];	// 151: -1, 0, or 1
								// 152 & 153: all set to 0
/* 154 */	sint8		short_buff_box;	// != 0, goes to short buff box. Not really supported in the server code
/* 155 */   int			descnum; // eqstr of description of spell
/* 156 */   int			typedescnum; // eqstr of type description
/* 157 */   int			effectdescnum; // eqstr of effect description
/* 158 */ int spacing158[4];
/* 162 */   int			bonushate;
/* 163 */ int spacing163[3];
/* 166 */   int			EndurCost;
/* 167 */   int			EndurTimerIndex;
/* 168 */ int spacing168[5];
/* 173 */   int			HateAdded;
/* 174 */   int			EndurUpkeep;
/* 175 */ int spacing175;
/* 176 */ int numhits;
/* 177 */ int pvpresistbase;
/* 178 */ int pvpresistcalc;
/* 179 */ int pvpresistcap;
/* 180 */ int spell_category;
/* 181 */ int spacing181[4];
/* 185 */ int can_mgb;	// 0=no, -1 or 1 = yes
/* 186 */ int dispel_flag;
/* 189 */ int MinResist;
/* 190 */ int MaxResist;
/* 192 */ int NimbusEffect;
/* 195 */ float directional_start;
/* 196 */ float directional_end;
/* 207 */ int spellgroup;
/* 209 */ int field209; // Need more investigation to figure out what to call this, for now we know -1 makes charm spells not break before their duration is complete, it does alot more though
/* 212 */ bool AllowRest;


//shared memory errors
/* 186 */	/*sint8		nodispell;*/	// 0=can be dispelled, -1=can't be dispelled at all, 1=most can be cancelled w/ a cure but not dispelled
/* 187 */	/*uint8		npc_category;*/	// 0=not used, 1=AoE Detrimental, 2=DD, 3=Buffs, 4=Pets, 5=Healing, 6=Gate, 7=Debuff, 8=Dispell
/* 188 */	/*uint32		npc_usefulness;*/	// higher number = more useful, lower number = less useful
/* 189 */ /*int spacing189[18];*/
/* 207 */	/*uint32		spellgroup;*/
/* 208 */ /*int spacing208[7];*/
// Might be newer fields in the live version, which is what some of the last fields are


			int8		DamageShieldType; // This field does not exist in spells_us.txt
};

#if defined(NEW_LoadSPDat) || defined(DB_LoadSPDat)
	extern const SPDat_Spell_Struct* spells; 
	extern sint32 SPDAT_RECORDS;
#else
	#define SPDAT_RECORDS	3602
#endif

bool IsTargetableAESpell(int16 spell_id);
bool IsSacrificeSpell(int16 spell_id);
bool IsLifetapSpell(int16 spell_id);
